CSI API ETABS v1

# cCaseResponseSpectrumGetDampOverrides Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetDampOverrides(
    	string Name,
    	ref int NumberItems,
    	ref int[] Mode,
    	ref double[] Damp
    )

    Function GetDampOverrides (
    	Name As String,
    	ByRef NumberItems As Integer,
    	ByRef Mode As Integer(),
    	ByRef Damp As Double()
    ) As Integer

    Dim instance As cCaseResponseSpectrum
    Dim Name As String
    Dim NumberItems As Integer
    Dim Mode As Integer()
    Dim Damp As Double()
    Dim returnValue As Integer

    returnValue = instance.GetDampOverrides(Name,
    	NumberItems, Mode, Damp)

    int GetDampOverrides(
    	String^ Name,
    	int% NumberItems,
    	array<int>^% Mode,
    	array<double>^% Damp
    )

    abstract GetDampOverrides :
            Name : string *
            NumberItems : int byref *
            Mode : int[] byref *
            Damp : float[] byref -> int

#### Parameters

Name

    Type: SystemString

NumberItems

    Type: SystemInt32

Mode

    Type: SystemInt32

Damp

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cCaseResponseSpectrum Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com